# -*- org-confirm-babel-evaluate: nil; -*-
#+STARTUP: showeverything

* Load data
#+begin_src jupyter-python :var fn=(buffer-file-name) :results none
  lines, year, day, examples = get_data(fn)
#+end_src

#+begin_src jupyter-python
  print_examples(examples)
  example_fn = INPUT_DIR / f"{year}_{day}_test"
  if len(examples) == 0 and example_fn.is_file():
      with (example_fn).open() as f:
          test_lines = f.read().splitlines()

      for line in test_lines:
          print(line)
#+end_src

#+RESULTS:
#+begin_example
  ------------------------------- Example data 1/6 -------------------------------
  .....
  .S-7.
  .|.|.
  .L-J.
  .....
  --------------------------------------------------------------------------------
  answer_a: 4
  answer_b: -
  ------------------------------- Example data 2/6 -------------------------------
  ..F7.
  .FJ|.
  SJ.L7
  |F--J
  LJ...
  --------------------------------------------------------------------------------
  answer_a: 8
  answer_b: -
  ------------------------------- Example data 3/6 -------------------------------
  ...........
  .S-------7.
  .|F-----7|.
  .||.....||.
  .||.....||.
  .|L-7.F-J|.
  .|..|.|..|.
  .L--J.L--J.
  ...........
  --------------------------------------------------------------------------------
  answer_a: -
  answer_b: 4
  ------------------------------- Example data 4/6 -------------------------------
  ..........
  .S------7.
  .|F----7|.
  .||OOOO||.
  .||OOOO||.
  .|L-7F-J|.
  .|II||II|.
  .L--JL--J.
  ..........
  --------------------------------------------------------------------------------
  answer_a: -
  answer_b: 4
  ------------------------------- Example data 5/6 -------------------------------
  .F----7F7F7F7F-7....
  .|F--7||||||||FJ....
  .||.FJ||||||||L7....
  FJL7L7LJLJ||LJ.L-7..
  L--J.L7...LJS7F-7L7.
  ....F-J..F7FJ|L7L7L7
  ....L7.F7||L7|.L7L7|
  .....|FJLJ|FJ|F7|.LJ
  ....FJL-7.||.||||...
  ....L---J.LJ.LJLJ...
  --------------------------------------------------------------------------------
  answer_a: -
  answer_b: 8
  ------------------------------- Example data 6/6 -------------------------------
  FF7FSF7F7F7F7F7F---7
  L|LJ||||||||||||F--J
  FL-7LJLJ||||||LJL-77
  F--JF--7||LJLJ7F7FJ-
  L---JF-JLJ.||-FJLJJ7
  |F|F-JF---7F7-L7L|7|
  |FFJF7L7F-JF7|JL---7
  7-L-JL7||F7|L7F-7F7|
  L.L7LFJ|||||FJL7||LJ
  L7JLJL-JLJLJL--JLJ.L
  --------------------------------------------------------------------------------
  answer_a: -
  answer_b: 10
#+end_example

* Test cases
#+begin_src jupyter-python
  for example in examples:
      ex_a, ex_b = solve(example.input_data.split("\n"))
      if ex_a is not None:
          print(ex_a)
          if example.answer_a is not None:
              assert str(ex_a) == example.answer_a
      if ex_b is not None:
          print(ex_b)
          if example.answer_b is not None:
              assert str(ex_b) == example.answer_b
      print()
#+end_src

#+RESULTS:
#+begin_example
  4
  1

  8
  1

  23
  4

  22
  4

  70
  8

  80
  10
#+end_example

* Get result
#+begin_src jupyter-python
  a1, a2 = solve(lines)
  print(a1)
  print(a2)
#+end_src

#+RESULTS:
: 6927
: 467
